ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/EQEP1_REG.xml
<module name="EQEP1_REG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="REG_QPOSCNT" acronym="REG_QPOSCNT" offset="0x0" width="32" description="Position Counter ">
		<bitfield id="QPOSCNT" width="32" begin="31" end="0" resetval="0x0" description="Position Counter This 32-bit position counter register counts up/down on every eQEP pulse based on direction input. This counter acts as a position integrator whose count value is proportional to position from a give reference point. This Register acts as a Read ONLY register while counter is counting up/down." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QPOSINIT" acronym="REG_QPOSINIT" offset="0x4" width="32" description="Position Counter Init ">
		<bitfield id="QPOSINIT" width="32" begin="31" end="0" resetval="0x0" description="Position Counter InitThis register contains the position value that is used to initialize the position counter based on external strobe or index event. The position counter can be initialized through software. Writes to this register should always be full 32-bit writes." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QPOSMAX" acronym="REG_QPOSMAX" offset="0x8" width="32" description="Maximum Position Count ">
		<bitfield id="QPOSMAX" width="32" begin="31" end="0" resetval="0x0" description="Maximum Position CountThis register contains the maximum position counter value. Writes to this register should always be full 32-bit writes." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QPOSCMP" acronym="REG_QPOSCMP" offset="0xC" width="32" description="Position Compare ">
		<bitfield id="QPOSCMP" width="32" begin="31" end="0" resetval="0x0" description="Position Compare The position-compare value in this register is compared with the position counter [QPOSCNT] to generate sync output and/or interrupt on compare match." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QPOSILAT" acronym="REG_QPOSILAT" offset="0x10" width="32" description="Index Position Latch ">
		<bitfield id="QPOSILAT" width="32" begin="31" end="0" resetval="0x0" description="Index Position Latch  The position-counter value is latched into this register on an index event as defined by the QEPCTL[IEL] bits." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="REG_QPOSSLAT" acronym="REG_QPOSSLAT" offset="0x14" width="32" description="Strobe Position Latch">
		<bitfield id="QPOSSLAT" width="32" begin="31" end="0" resetval="0x0" description="Strobe Position Latch  The position-counter value is latched into this register on a strobe event as defined by the QEPCTL[SEL] bits." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="REG_QPOSLAT" acronym="REG_QPOSLAT" offset="0x18" width="32" description="Position Latch ">
		<bitfield id="QPOSLAT" width="32" begin="31" end="0" resetval="0x0" description="Position Latch  The position-counter value is latched into this register on a unit time out event." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="REG_QUTMR" acronym="REG_QUTMR" offset="0x1C" width="32" description="QEP Unit Timer ">
		<bitfield id="QUTMR" width="32" begin="31" end="0" resetval="0x0" description="QEP Unit TimerThis register acts as time base for unit time event generation. When this timer value matches the unit time period value a unit time event is generated." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QUPRD" acronym="REG_QUPRD" offset="0x20" width="32" description="QEP Unit Period ">
		<bitfield id="QUPRD" width="32" begin="31" end="0" resetval="0x0" description="QEP Unit PeriodThis register contains the period count for the unit timer to generate periodic unit time events. These events latch the eQEP position information at periodic intervals and optionally generate an interrupt. Writes to this register should always be full 32-bit writes." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QWDTMR" acronym="REG_QWDTMR" offset="0x24" width="16" description="QEP Watchdog Timer ">
		<bitfield id="QWDTMR" width="16" begin="15" end="0" resetval="0x0" description="QEP Watchdog Timer This register acts as time base for the watchdog to detect motor stalls. When this timer value matches with the watchdog's period value a watchdog timeout interrupt is generated. This register is reset upon edge transition in quadrature-clock indicating the motion." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QWDPRD" acronym="REG_QWDPRD" offset="0x26" width="16" description="QEP Watchdog Period ">
		<bitfield id="QWDPRD" width="16" begin="15" end="0" resetval="0x0" description="QEP Watchdog Period This register contains the time-out count for the eQEP peripheral watch dog timer.When the watchdog timer value matches the watchdog period value, a watchdog timeout interrupt is generated." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QDECCTL_TYPE2" acronym="REG_QDECCTL_TYPE2" offset="0x28" width="16" description="Quadrature Decoder Control ">
		<bitfield id="QSRC" width="2" begin="15" end="14" resetval="0x0" description="Position-counter source selection" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="SOEN" width="1" begin="13" end="13" resetval="0x0" description="Sync output-enable" range="13" rwaccess="R/W"/> 
		<bitfield id="SPSEL" width="1" begin="12" end="12" resetval="0x0" description="Sync output pin selection" range="12" rwaccess="R/W"/> 
		<bitfield id="XCR" width="1" begin="11" end="11" resetval="0x0" description="External Clock Rate" range="11" rwaccess="R/W"/> 
		<bitfield id="SWAP" width="1" begin="10" end="10" resetval="0x0" description="CLK/DIR Signal Source for Position Counter " range="10" rwaccess="R/W"/> 
		<bitfield id="IGATE" width="1" begin="9" end="9" resetval="0x0" description="Index pulse gating option" range="9" rwaccess="R/W"/> 
		<bitfield id="QAP" width="1" begin="8" end="8" resetval="0x0" description="QEPA input polarity" range="8" rwaccess="R/W"/> 
		<bitfield id="QBP" width="1" begin="7" end="7" resetval="0x0" description="QEPB input polarity" range="7" rwaccess="R/W"/> 
		<bitfield id="QIP" width="1" begin="6" end="6" resetval="0x0" description="QEPI input polarity" range="6" rwaccess="R/W"/> 
		<bitfield id="QSP" width="1" begin="5" end="5" resetval="0x0" description="QEPS input polarity" range="5" rwaccess="R/W"/> 
		<bitfield id="QIDIRE" width="1" begin="0" end="0" resetval="0x0" description="0 - Compatible mode, Behavior same as existing devices1 - Enhancement for Direction change during Index will be enabled" range="0" rwaccess="R/W"/>
	</register>
	<register id="REG_QEPCTL" acronym="REG_QEPCTL" offset="0x2A" width="16" description="QEP Control ">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation mode " range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="PCRM" width="2" begin="13" end="12" resetval="0x0" description="Postion counter reset " range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="SEI" width="2" begin="11" end="10" resetval="0x0" description="Strobe event initialization of position counter" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="IEI" width="2" begin="9" end="8" resetval="0x0" description="Index event init of position count " range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SWI" width="1" begin="7" end="7" resetval="0x0" description="Software init position counter" range="7" rwaccess="R/W"/> 
		<bitfield id="SEL" width="1" begin="6" end="6" resetval="0x0" description="Strobe event latch of position counter" range="6" rwaccess="R/W"/> 
		<bitfield id="IEL" width="2" begin="5" end="4" resetval="0x0" description="Index event latch of position counter [software index marker]" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="QPEN" width="1" begin="3" end="3" resetval="0x0" description="Quadrature position counter enable/software reset" range="3" rwaccess="R/W"/> 
		<bitfield id="QCLM" width="1" begin="2" end="2" resetval="0x0" description="QEP capture latch mode " range="2" rwaccess="R/W"/> 
		<bitfield id="UTE" width="1" begin="1" end="1" resetval="0x0" description="QEP unit timer enable" range="1" rwaccess="R/W"/> 
		<bitfield id="WDE" width="1" begin="0" end="0" resetval="0x0" description="QEP watchdog enable " range="0" rwaccess="R/W"/>
	</register>
	<register id="REG_QCAPCTL" acronym="REG_QCAPCTL" offset="0x2C" width="16" description="Qaudrature Capture Control ">
		<bitfield id="CEN" width="1" begin="15" end="15" resetval="0x0" description="Enable eQEP capture" range="15" rwaccess="R/W"/> 
		<bitfield id="CCPS" width="3" begin="6" end="4" resetval="0x0" description="eQEP capture timer clock prescaler" range="6 - 4" rwaccess="R/W"/> 
		<bitfield id="UPPS" width="4" begin="3" end="0" resetval="0x0" description="Unit position event prescaler" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QPOSCTL" acronym="REG_QPOSCTL" offset="0x2E" width="16" description="Position Compare Control ">
		<bitfield id="PCSHDW" width="1" begin="15" end="15" resetval="0x0" description="Position compare of shadow enable" range="15" rwaccess="R/W"/> 
		<bitfield id="PCLOAD" width="1" begin="14" end="14" resetval="0x0" description="Position compare of shadow load " range="14" rwaccess="R/W"/> 
		<bitfield id="PCPOL" width="1" begin="13" end="13" resetval="0x0" description="Polarity of sync output " range="13" rwaccess="R/W"/> 
		<bitfield id="PCE" width="1" begin="12" end="12" resetval="0x0" description="Position compare enable/disable " range="12" rwaccess="R/W"/> 
		<bitfield id="PCSPW" width="12" begin="11" end="0" resetval="0x0" description="Select-position-compare sync output pulse width" range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QEINT_TYPE1" acronym="REG_QEINT_TYPE1" offset="0x30" width="16" description="QEP Interrupt Control ">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error Interrupt enable" range="12" rwaccess="R/W"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt enable" range="11" rwaccess="R/W"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt enable" range="10" rwaccess="R/W"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt enable" range="9" rwaccess="R/W"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Position-compare match interrupt enable" range="8" rwaccess="R/W"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt enable" range="7" rwaccess="R/W"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt enable" range="6" rwaccess="R/W"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt enable" range="5" rwaccess="R/W"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog time out interrupt enable" range="4" rwaccess="R/W"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt enable" range="3" rwaccess="R/W"/> 
		<bitfield id="QPE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt enable" range="2" rwaccess="R/W"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt enable" range="1" rwaccess="R/W"/>
	</register>
	<register id="REG_QFLG_TYPE1" acronym="REG_QFLG_TYPE1" offset="0x32" width="16" description="QEP Interrupt Flag ">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error interrupt flag" range="12" rwaccess="R"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt flag" range="11" rwaccess="R"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt flag" range="10" rwaccess="R"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt flag" range="9" rwaccess="R"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="eQEP compare match event interrupt flag" range="8" rwaccess="R"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt flag" range="7" rwaccess="R"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt flag" range="6" rwaccess="R"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt flag" range="5" rwaccess="R"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog timeout interrupt flag" range="4" rwaccess="R"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt flag" range="3" rwaccess="R"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt flag" range="2" rwaccess="R"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt flag" range="1" rwaccess="R"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt status flag" range="0" rwaccess="R"/>
	</register>
	<register id="REG_QCLR_TYPE1" acronym="REG_QCLR_TYPE1" offset="0x34" width="16" description="QEP Interrupt Clear ">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Clear QMA Error interrupt flag" range="12" rwaccess="R/W"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Clear unit time out interrupt flag" range="11" rwaccess="R/W"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Clear index event latch interrupt flag" range="10" rwaccess="R/W"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Clear strobe event latch interrupt flag" range="9" rwaccess="R/W"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Clear eQEP compare match event interrupt flag" range="8" rwaccess="R/W"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Clear position-compare ready interrupt flag" range="7" rwaccess="R/W"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Clear position counter overflow interrupt flag" range="6" rwaccess="R/W"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Clear position counter underflow interrupt flag" range="5" rwaccess="R/W"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Clear watchdog timeout interrupt flag" range="4" rwaccess="R/W"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Clear quadrature direction change interrupt flag" range="3" rwaccess="R/W"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Clear quadrature phase error interrupt flag" range="2" rwaccess="R/W"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Clear position counter error interrupt flag" range="1" rwaccess="R/W"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt clear flag" range="0" rwaccess="R/W"/>
	</register>
	<register id="REG_QFRC_TYPE1" acronym="REG_QFRC_TYPE1" offset="0x36" width="16" description="QEP Interrupt Force ">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Force QMA error interrupt" range="12" rwaccess="R/W"/> 
		<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Force unit time out interrupt" range="11" rwaccess="R/W"/> 
		<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Force index event latch interrupt" range="10" rwaccess="R/W"/> 
		<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Force strobe event latch interrupt" range="9" rwaccess="R/W"/> 
		<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Force position-compare match interrupt" range="8" rwaccess="R/W"/> 
		<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Force position-compare ready interrupt" range="7" rwaccess="R/W"/> 
		<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Force position counter overflow interrupt" range="6" rwaccess="R/W"/> 
		<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Force position counter underflow interrupt" range="5" rwaccess="R/W"/> 
		<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Force watchdog time out interrupt" range="4" rwaccess="R/W"/> 
		<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Force quadrature direction change interrupt" range="3" rwaccess="R/W"/> 
		<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Force quadrature phase error interrupt" range="2" rwaccess="R/W"/> 
		<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Force position counter error interrupt" range="1" rwaccess="R/W"/>
	</register>
	<register id="REG_QEPSTS_TYPE1" acronym="REG_QEPSTS_TYPE1" offset="0x38" width="16" description="QEP Status ">
		<bitfield id="UPEVNT" width="1" begin="7" end="7" resetval="0x1" description="Unit position event flag" range="7" rwaccess="R/W"/> 
		<bitfield id="FIDF" width="1" begin="6" end="6" resetval="0x0" description="Direction on the first index markerStatus of the direction is latched on the first index event marker." range="6" rwaccess="R"/> 
		<bitfield id="QDF" width="1" begin="5" end="5" resetval="0x0" description="Quadrature direction flag" range="5" rwaccess="R"/> 
		<bitfield id="QDLF" width="1" begin="4" end="4" resetval="0x0" description="eQEP direction latch flag" range="4" rwaccess="R"/> 
		<bitfield id="COEF" width="1" begin="3" end="3" resetval="0x0" description="Capture overflow error flag" range="3" rwaccess="R/W"/> 
		<bitfield id="CDEF" width="1" begin="2" end="2" resetval="0x0" description="Capture direction error flag" range="2" rwaccess="R/W"/> 
		<bitfield id="FIMF" width="1" begin="1" end="1" resetval="0x0" description="First index marker flag" range="1" rwaccess="R/W"/> 
		<bitfield id="PCEF" width="1" begin="0" end="0" resetval="0x0" description="Position counter error flag. This bit is not sticky and it is updated for every index event." range="0" rwaccess="R"/>
	</register>
	<register id="REG_QCTMR" acronym="REG_QCTMR" offset="0x3A" width="16" description="QEP Capture Timer ">
		<bitfield id="QCTMR" width="16" begin="15" end="0" resetval="0x0" description="This register provides time base for edge capture unit." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QCPRD" acronym="REG_QCPRD" offset="0x3C" width="16" description="QEP Capture Period ">
		<bitfield id="QCPRD" width="16" begin="15" end="0" resetval="0x0" description="This register holds the period count value between the last successive eQEP position events" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QCTMRLAT" acronym="REG_QCTMRLAT" offset="0x3E" width="16" description="QEP Capture Latch ">
		<bitfield id="QCTMRLAT" width="16" begin="15" end="0" resetval="0x0" description="The eQEP capture timer value can be latched into this register on two events viz., unit timeout event, reading the eQEP position counter." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REG_QCPRDLAT" acronym="REG_QCPRDLAT" offset="0x40" width="16" description="QEP Capture Period Latch ">
		<bitfield id="QCPRDLAT" width="16" begin="15" end="0" resetval="0x0" description="eQEP capture period value can be latched into this register on two events viz., unit timeout event, reading the eQEP position counter." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REG_Reserved_1" acronym="REG_Reserved_1" offset="0x42" width="16" description="">
		
	</register>
	<register id="REG_REV_TYPE2" acronym="REG_REV_TYPE2" offset="0x60" width="32" description="QEP Revision Number">
		<bitfield id="MINOR" width="3" begin="5" end="3" resetval="0x1" description="This field specifies the Minor Revision number for the eQEP IP. " range="5 - 3" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="2" end="0" resetval="0x1" description="This field specifies the Major Revision number for the eQEP IP. " range="2 - 0" rwaccess="R"/>
	</register>
	<register id="REG_QEPSTROBESEL" acronym="REG_QEPSTROBESEL" offset="0x64" width="32" description="QEP Strobe select register">
		<bitfield id="STROBESEL" width="2" begin="1" end="0" resetval="0x0" description="Strobe source select:" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QMACTRL" acronym="REG_QMACTRL" offset="0x68" width="32" description="QMA Control register">
		<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="Select Mode for QMA mode:000 : QMA Module is bypassed. 001 : QMA Mode-1 operation selected010 : QMA Mode-2 operation selected011 : QMA Module is bypassed [reserved]1xx  : QMA Module is bypassed [reserved]" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_QEPSRCSEL" acronym="REG_QEPSRCSEL" offset="0x6C" width="32" description="QEP Source Select Register">
		<bitfield id="QEPSSEL" width="4" begin="15" end="12" resetval="0x0" description="QEP Strobe source select:0000: From device Pins [Default].0001-1111: Device dependent." range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="QEPISEL" width="4" begin="11" end="8" resetval="0x0" description="QEP Index source select:0000: From device Pins [Default].0001-1111: Device dependent." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="QEPBSEL" width="4" begin="7" end="4" resetval="0x0" description="QEPB source select:0000: From device Pins [Default].0001-1111: Device dependent." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="QEPASEL" width="4" begin="3" end="0" resetval="0x0" description="QEPA source select:0000: From device Pins [Default].0001-1111: Device dependent." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="REG_Reserved_2" acronym="REG_Reserved_2" offset="0x70" width="16" description="">
		
	</register>
</module>